#-------------------------------------------------------------
# 다양한 함수의 형태 - (1) 기본
#-------------------------------------------------------------
# 함수 기능: 팩토리얼을 계산 후 계산 결과를 반환해주는 기능
#           3! = 3 * 2*  1
# 함수 이름: factorial
# 매개 변수: x
# 반 환 값: 팩토리얼
#-------------------------------------------------------------


# for 문
def fact(x):
    ret = 1
    if x:
        for n in range(x,0,-1): ret *= n
        return ret
print(fact(4))

#-------------------------------------------------------------
# 함수 기능: 팩토리얼을 계산 후 계산 결과를 반환해주는 기능
#           3! = 3 * 2*  1
# 함수 이름: factorial
# 매개 변수: x
# 반 환 값: 계산 str
#-------------------------------------------------------------
def fact(x):
    if x == 0:
        return 1 # x=0 일때 1이 반환됨
    while x:
        print(f'{x}! = {x}*{x-1}')
        return x*fact(x-1)
print(fact(3))

strRet='3! ='
intRet=1
for n in range(3,0,-1):
    strRet = strRet + str(n) + ('*' if n!= 1 else ' = ')
    intRet *= n
    print(strRet, intRet)

def fact(x):
    a = 1
    if x:
        for i in range(x,0,-1): a *= i
        return a
print(fact(5))









